#str ესენია უბრალო სიტყვები რომლითაც არითმეტიკულ დავალებებს ვერ გავაკეთებთ მაგ:1, 1.2 , ა , b
#int მხოლოდ მთელი რიცხვები, მისით არითმეტიკულ დავალებებს გავაკეთებთ მაგ: 1 , 12
#float მხოლოდ წილადის რიცხვები, მისით არითმეტიკულ დავალებებს გავაკეთებთ მაგ:
#boolen მხოლოდ True და False
#თქვენი სიტყვებით ახსენით რაში გვჭირდება მონაცემთა ტიპის შეცვლა, მაგალითად string'ის integer'ად გადაქცევა:
a = input("")
b = input("")
output = int(a) + int(b)
print(output)
#ეს რომ არ მექნა არრითმეტიკული სამუშაო ვეღარ მოხდებოდა რადგან string-ს string-ს ვერ დავამატებთ 
typ = input("1")
print(type(typ))
# string-ად რადგან input-ის ფრჩხილებში არის ""
print(10 < 1)
#რადგან 10 მეტია 1-ზე

