str = ("ესენია უბრალო სიტყვები რომლითაც არითმეტიკულ დავალებებს ვერ გავაკეთებთ მაგ:1, 1.2 , ა , b ")
int1 = (1)
int2 = (2)
float1 = (2.2)
float = (2.1)
booleenT = True
bppleenF = False

print ("მხოლოდ მთელი რიცხვები, მისით არითმეტიკულ დავალებებს გავაკეთებთ მაგ:" ) 
print (int1 + int2)
print ("მხოლოდ წილადის რიცხვები, მისით არითმეტიკულ დავალებებს გავაკეთებთ მაგ:" )
print (float + float1)

#concatenation

str1 = ("Hello")
space = (" ")
str2 = ("Hi")

print (str1 + space + str2)

#3) ახსენით რატომ არ შეგვიძლია გავაკეთოთ მათემატიკური ოპერაცია ისეთ რიცხვებზე რომლებიც არის ჩასმული ბრჭყალებში

exm1 = ("2")
exm2 = ("3")

print (exm1 + exm2)

#რადგან როდესაც ის ბრწყალშია ის string-ად ითვლება  

print ( int(4 / 2))

# print (type(exm1))
# implicit - როდესაც ხელით ვცვლით
# expplicit - მაგ : 50 / 2 = 25.0 და არა 25

# <=
# =>
# <
# >
# =